<a href="https://colab.research.google.com/github/Molal/Advanced-Python-class/blob/main/Database_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#pip install mysql-connector-python 
#pip install --upgrade pip

#create the database now 
1: Create a Database in MySQL and name it:  Company
2: Create a table in the company Database and name it employee Show your work/script.

In the Employee Table, put the following fields.
	a) employee_id
	b) first_name
	c) last_name
	d) email
	e) phone_number
	f) hire_date
	g) job_id
	h) salary
	i) manager_id
    j) department_id
	
2: Create a table in the company Database and name it departments. Show your work/script.	

In the departments Table, put the following fields.	
	a) department_id
	b) department_name
	c) location_id
	
3: Create a table in the company Database and name it jobs. Show your work/script.

In the jobs Table, put the following fields.
	a) job_id
	b) job_title
	c) min_salary
	d) max_salary
	
4: Insert into the 3 above tables some fictious records. Make up at least 10 records for the Employee Table, the department table and the jobs table. Show your work/script.

5: Once created and the records inserted. Please display on the screen using Python Script the content of all the 3 tables. Show your work/script..

6: Also using the MySQL statement, please join the 3 tables and display their contents using Python scripting. Show your work/script..

7: Update the records table and inser these 3 employees
	ii) employee_id: 0091, first name: Annabel Nganga, create her email using her first and last name and assign a salary, manager_id and dept_id
	ii) employee_id: 0092, first name: Esther Wambui, create her email using her first and last name and assign a salary, manager_id and dept_id
	iii) employee_id: 0094, first name: Migot Ndede, create his email using his first and last name and assign a salary, manager_id and dept_id
	
8: Make changes to the Employee table structure and add a cell_phone number and physical address. Please show the code you used to make changed to the table structure.

9: Make changes to the first name of employee id 0094 to George. Please show the details of your code used to do that.

10: Delete employee number ID 0094 from the database. Please show the code you used to do that.

Your tools of choice would be to use 

1) MySQL workbench
2) Python scripting Language

When done, don't rush to send to GitHub, make sure that your work makes sense, and that this is an Advanced Python Class and sork like you are doing it
for your employment. Just so you know. NO sloppy code and do not copy and paste neither. Do it like your life depends on it.

In case you are stuck, don't wait until Sunday to bring it up. Engage me and let us work all together to assist you also Google is your friend. IT IS IMPORTANT.

In [ ]:
import mysql.connector as conn 
mydb = conn.connect(
        host = 'localhost',
        user = 'root',
        password = 'Lexie@2017',
        database = 'company')
print('connect to mydb')
cursor = mydb.cursor()

connect to mydb

In [ ]:
cursor = mydb.cursor()

In [ ]:
cursor.execute('CREATE DATABASE IF NOT EXISTS company')
print("Database created")

Database created

In [ ]:
#creating the employees tables 
cursor.execute('''CREATE TABLE IF NOT EXISTS employee (
Employees_id INT(5) AUTO_INCREMENT PRIMARY KEY NOT NULL UNIQUE,
F_name VARCHAR(100) NOT NULL,
L_name VARCHAR(100) NOT NULL,
Email VARCHAR(100) NOT NULL,
Phone_number INT(10) NOT NULL,
Hire_Date VARCHAR(5) NOT NULL, 
Job_Id INT(5) NOT NULL, 
Salary INT(5) NOT NULL, 
Manager_ID INT(5) NOT NULL, 
Depertment_ID INT(5) NOT NULL)''')

print("employees table created")

employees table created

In [ ]:
cursor.execute('''CREATE TABLE IF NOT EXISTS depertments (
 Department_id INT(5) PRIMARY KEY NOT NULL UNIQUE, 
 Department_name VARCHAR(100) NOT NULL,
 Location_id VARCHAR(100) NOT NULL)''')

In [ ]:
cursor.execute('''CREATE TABLE IF NOT EXISTS job(
 job_id INT (5) NOT NULL UNIQUE,
 job_title VARCHAR(100) NOT NULL,
 min_salary INT(5) NOT NULL, 
 max_salary INT(5) NOT NULL)''')

In [ ]:
mysql = 'INSERT IGNORE INTO employee ( Employees_id,F_name,L_name,Email,Phone_number,Hire_Date,Job_Id,Salary,Manager_ID,Depertment_ID) VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)' 
var = [
    (1,'peter','onyango','onyangop@gmail.com',72378665,'2020',76798,70000,67878,76867),
    (2, 'victor', 'brian', 'vbrian@yahoo.com',87874857, '2019',87989,870000,767679,87877),
    (3, 'Hillary', 'oloo', 'hc@hotmail.com', 897894768, '2020',34325,600000,5464536,746476)
   
]

cursor.executemany(mysql,var)
mydb.commit()

In [ ]:
mysql1= 'INSERT IGNORE INTO depertments ( Department_id,  Department_name, Location_id) VALUES (%s,%s,%s)'
var1 = [
    (1,'Agri-business', 9787),
    (2, 'Mathematics', 3452),
    (3, 'Economics', 6745)
]
cursor.executemany(mysql1,var1)
mydb.commit()

In [ ]:
mysql2 = 'INSERT IGNORE INTO job( job_id,job_title, min_salary, max_salary) VALUES(%s,%s,%s,%s)'
var2 = [
    (1, 'Engineer',300,500),
    (2, 'Statisticain' ,350, 560),
    (3, 'Tutor',200,500 )
]
cursor.executemany(mysql2,var2)
mydb.commit()

In [ ]:
cursor.execute('SELECT * FROM employee')
employees = cursor.fetchall()
for x in employees:
    print(x)

(1, 'Annabel', 'Nganga', 'annenganga@hotmail.com', 72378665, '2020', 76798, 70000, 67878, 76867, 0, 0)
(2, 'victor', 'brian', 'vbrian@yahoo.com', 87874857, '2019', 87989, 870000, 767679, 87877, 0, 0)

In [ ]:
cursor.execute('SELECT * FROM job')
employees = cursor.fetchall()
for y in employees:
    print(y)

(1, 'Engineer', 300, 500)
(2, 'Statisticain', 350, 560)
(3, 'Tutor', 200, 500)

In [ ]:
cursor.execute('SELECT * FROM depertments')
employees = cursor.fetchall()
for c in employees:
    print(c)

(1, 'Agri-business', '9787')
(2, 'Mathematics', '3452')
(3, 'Economics', '6745')

cursor.execute('''SELECT * FROM job 
INNER JOIN employee on job.job_id = employee.Employees_id
  ''')
x = cursor.fetchall()
for c in x:
    print(c)

In [ ]:
cursor.execute( ''' UPDATE employee SET F_name = 'Annabel', L_name = 'Nganga', 
Email = 'annenganga@hotmail.com' WHERE Employees_id = 1 ''')

In [ ]:
cursor.execute('''ALTER TABLE employee ADD (
cell_number INT(10) NOT NULL, 
physical_address INT(10) NOT NULL)''')
print('altertable')

altertable

In [ ]:
cursor.execute('''DELETE FROM employee WHERE Employees_id = 3''')